[
  {
    "title": "Software Engineering Intern",
    "name": "Speedway Motors Inc.",
    "description": "Speedway Motors is America's Oldest Speed Shop® and has been a trusted source for high performance parts for street rods and racing for over 68 years. Speedway Motors has built a reputation for superior service, heavily aided by a strong online shopping experience.",
    "startDate": "May 2022",
    "endDate": "Current",
    "contributions": [
      "Increased customer conversions and product impressions by expanding recommendations across the majority of Speedway Motors pages.",
      "Improved the performance of checkout and shopping cart read / write operations by optimizing related API calls.",
      "Collaborated with intern cohort to extend the Speedway Motors onboarding process.",
      "Aided in development of a Selenium test suite to ensure the validity of code across all environments."
    ]
  },
  {
    "title": "Web Developer for Yao Labs",
    "name": "UNL FYRE Program",
    "description": "The First Year Research Experience (FYRE) Program is a program designed to give first-year students the opportunity to work with faculty on research projects. The program is designed to help students develop research skills, learn about research opportunities at UNL, and engage with faculty and other students in a research community.",
    "startDate": "August 2021",
    "endDate": "May 2022",
    "contributions": [
      "Develop web pages using HTML, CSS, Python, JavaScript, and Bootstrap technologies.",
      "Monitor the growth of the virtual reality industry and coordinate project plans around developing virtual reality simulation software.",
      "Collaborate with Dr. Yao to learn web design technologies and develop project plans."
    ]
  },
  {
    "title": "Business Owner",
    "name": "Limitless Reality",
    "description": "Limitless Reality is a virtual reality business that I created and ran at the ages of 15-16 before the Covid-19 pandemic. Limitless Reality allowed me to explore my interests of virtual reality and running a business at a young age, giving my career a head-start.",
    "startDate": "September 2019",
    "endDate": "February 2020",
    "contributions": [
      "Developed an efficient virtual reality user \"onboarding\" experience to quickly and effectively help customers use the system.",
      "Collaborated with Eagle Hollow Haunts during the fall season to deploy two HTC Vive virtual reality attractions.",
      "Hired, managed, trained, and collaborated with three employees to set up and maintain two booths with HTC Vive virtual reality systems."
    ]
  }
]